п»ї#include <iostream>
#include <array>

using namespace std;

int main()
{
	setlocale(LC_ALL, "RUS");
	
	array<int, 4> arr = { 5,7,8,9 };

	///////////////////////////////////////////////////////////////////
	cout << "РћР±СЂР°С‰РµРЅРёРµ Рє СЌР»РµРјРµРЅС‚Сѓ С‡РµСЂРµР· at: ";
	cout << arr.at(0) << endl;
	cout << endl << endl;

	///////////////////////////////////////////////////////////////////
	cout << "РџРѕРёСЃРє РѕС€РёР±РєРё С‡РµСЂРµР· exception: " << endl;
	try
	{
		cout << arr.at(5) << endl;
	}
	catch(const exception &ex)
	{
		cout << ex.what() << endl;
	}

	cout << endl;

	///////////////////////////////////////////////////////////////////
	cout << "Р—Р°РїРѕР»РЅРµРЅРёРµ array: " << endl;

	for (int i = 0; i < arr.size() ;i++)
	{
		cout << "Р’РІРµРґРёС‚Рµ С‡РёСЃР»Рѕ: ";
		cin >> arr[i];
	}
	cout << endl;

	///////////////////////////////////////////////////////////////////
	cout << "Range based С†РёРєР»: " << endl;
	for (auto i : arr)
	{
		cout << i << " ";
	}
	cout << endl << endl;

	///////////////////////////////////////////////////////////////////
	cout << "Р”РѕСЃС‚СѓРї Рє РїРµСЂРІРѕРјСѓ СЌР»РµРјРµРЅС‚Сѓ: " << arr.front() << endl;
	cout << "Р”РѕСЃС‚СѓРї Рє РїРѕСЃР»РµРґРЅРµРјСѓ СЌР»РµРјРµРЅС‚Сѓ: " << arr.back() << endl;

	return 0;
}