//Заменить несколько пробелов на один

#include <iostream>
#include <stdio.h>
#include <cstring>
#include <windows.h>

using namespace std;

main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    int i, j, n;//Переменные
    char s[1000];//Переменная для текста

    cout << "Введите ваш текст: ";

    gets(s);//Считываем текст пользователя

    n = strlen (s);//Узнаём длину пользовательского текста

    for (i=0; i<n; i++)// Начинаем цикл по символьно

        if ( s[i] == ' ' and s[i+1] == ' ')//Проверяем, если символ и последующий являются пробелами, выполняем условие
        {
            for (j=i; j<n; j++) //Начинаем цикл по смещению
            {
                s[j] = s[j+1];//Смещение
            }
            n--; //уменьшаем размер строки
            i--; //уменьшаем номер
        }
    cout << "Ваш отредактированный текст: " << s;//Выводим текст без лишних пробелов
}
