//Площадь треугольника, стороны которого ввёл пользователь

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    float a,b,c;
    cout<< "Введите первую сторону треугольника: ";
    cin>> a ;

    cout<< "Введите вторую сторону треугольника: ";
    cin>> b ;

    cout<< "Введите третью сторону треугольника: ";
    cin>> c ;

    cout<< "Первая сторона треугольника: "<<a<< " см"<< endl;
    cout<< "Вторая сторона треугольника: "<<b<< " см"<< endl;
    cout<< "Третья сторона треугольника: "<<c<< " см"<< endl;

    float S, p;


    p=(a+b+c)/2;

    S=sqrt(p*(p-a)*(p-b)*(p-c));

    cout<<"Площадь вашего треугольника: "<< S << "см2"<< endl;
}
