//В одномерном массиве, вводимом с клавиатуры и состоящем из N вещественных элеметов вычислить
//Количество элементов массива больше чем С (С вводится с клавиатуры)
#include <iostream>
using namespace std;
main()
{
    setlocale (LC_ALL,"Russian");
    cout<<"Введите количество элементов: ";
    int n,x[1000],k=0;
    cin>>n;
    int c;
    cout<<"Введите значение С: ";
    cin>>c;

    for (int i=0;i<n;i++)
    {
        cout<<"Введите число: ";
        cin>>x[i];
    }

    for (int i=0;i<n;i++)
    {
        if (x[i]>c) k++;
    }
    cout<<"В массиве, чисел, которые больше С: "<<k;
}
