//Последняя цифра числа, полученная при возведении 2 в N степень.

#include <iostream>

using namespace std;

main()
{
    setlocale (LC_ALL,"Russian");
    cout<<"Привет, друг!";
    cout<<"\nДавай я найду последнюю цифру твоей степени.";
    cout<<"\nВведи степень для числа 2: ";
    int x;
    cin>>x;
    int x1,x2,x3,x4;


    x1=x%4;


    switch (x1)
    {
    case 1:{cout<<"Последняя цифра возведенного вами числа является 2";break;}
    case 2:{cout<<"Последняя цифра возведенного вами числа является 4";break;}
    case 3:{cout<<"Последняя цифра возведенного вами числа является 8";break;}
    case 0:{cout<<"Последняя цифра возведенного вами числа является 6";break;}
    }

}
