//Ввод матрицы
//Суммируем матрицу, если число положительное
//Считаем количество чётных элементов матрицы
//Считаем количество чётных элементов матрицы в каждой стоке
//Одномерный массив из минимальных элементов матрицы
//Создаём матрицу из 0 и 1 (в зависимости от чётности и нечётности)
//Вычитаем исходную матрицу из новой
//Заменяем столбец матрицы с толбцом заданным пользователем

#include <iostream>
#include <cmath>

using namespace std;

main()
{
    setlocale (LC_ALL,"Russian");
    cout<<"Введите количество строк: ";
    int n,m,mat[20][20];
    cin>>n;
    cout<<"Введите количество столбцов: ";
    cin>>m;

    for (int i=0; i<n; i++)
    {
        for (int j=0; j<n; j++)
        {
            cout<<"Введите число матрицы для "<<i<<" строчки "<<j<<" столбца: ";
            cin>>mat[i][j];
        }
    }

    cout<<endl;
    int S=0,k=0,ps=0;
    for (int i=0; i<n; i++)
    {
        ps=0;//Обнуляем счётчик положительных элементов для следующих строк

        for (int j=0; j<n; j++)
        {
            if (mat[i][j]>0) S+=mat[i][j];//Суммируем матрицу, если число положительное
            if (mat[i][j]%2==0) k++;//Считаем количество чётных элементов матрицы
            if (mat[i][j]>0) ps++; //Считаем количество чётных элементов матрицы в каждой стоке


        }

        cout<<endl<<"Количество положительных элементов в "<<i<<" строке: "<<ps;
    }

    cout<<"\n\n";
    cout<<"Количество чётных элементов матрицы: "<<k;
    cout<<"\n";
    cout<<"Сумма положительных элементов матрицы: "<<S;
    cout<<"\n";
    cout<<endl;

    int sc=0;
    int x[40];
    int i=0,j=0;


    for (int i=0; i<n; i++)
    {
     int min=mat[i][0];
        sc++;//Счётчик количества строк
        for (int j=0; j<n; j++)
        {
            if (min>=mat[i][j])//Проверяем на минимальное число в строке матрицы
            {
                min=mat[i][j];//Присваивакм min минимальное значение строки матрицы
                x[i]=mat[i][j];//Вставляем в одномерный массив минимальное значение строки матрицы

            }
        }
    }
    cout<<"Одномерный массив содержащий минимальные элементы матрицы: "<<endl;
    for (int i=0; i<sc; i++)
    {
        cout<<x[i]<<" ";
    }

    cout<<"\n\nМатрица: "<<endl;

    for (int i=0; i<n; i++)
    {
        for (int j=0; j<n; j++)
            cout<<mat[i][j]<<"\t";
        cout<<endl;
    }

    int matz[20][20];//Создаём дополнительную матрицу с исходными элементами для будующего использования
    for (int i=0;i<n;i++)
    {

        for (int j=0;j<m;j++)
        matz[i][j]=mat[i][j];
    }


    int b[20][20];//Создаём матрицу из 0 и 1 (в зависимости от чётности и нечётности)
    for (int i=0; i<n; i++)
    {
        for (int j=0; j<m; j++)
        {
            if (mat[i][j]%2==0) b[i][j]=0;
            else b[i][j]=1;
        }
    }

    cout<<"\n\nМатрица 0 и 1 (в зависимости от чётности и нечётности): "<<endl;
    for (int i=0; i<n; i++)
    {
        for (int j=0; j<m; j++)
            cout<<b[i][j]<<"\t";
        cout<<endl;
    }

    cout<<"\n\n\n\n";
    cout<<"Создадим новую матрицу. "<<endl;

    int mat2[20][20];


    for (int i=0; i<n; i++)//Создаём новую матрицу
    {
        for (int j=0; j<n; j++)
        {
            cout<<"Введите число матрицы для "<<i<<" строчки "<<j<<" столбца: ";
            cin>>mat2[i][j];
        }
    }
    int c[20][20];//Вычитаем исходную матрицу из новой
    for (int i=0; i<n; i++)
    {
        for (int j=0; j<m; j++)
            {c[i][j]=abs(matz[i][j]-mat2[i][j]);}
    }
    cout<<"\n\n";
    cout<<"Сумма вашей новой матрицы и исходной: "<<endl;
    for (int i=0; i<n; i++)
    {
        for (int j=0; j<m; j++)
            cout<<c[i][j]<<"\t";
        cout<<endl;
    }

    cout<<"\n\nТеперь поменяем столбцы в исходной матрице.";
    cout<<"Введите номер столбец, который мы заменим: ";
    int q=0,p=0,t;
    cin>>p;
    cout<<"Ввидети номер столбец, на который мы заменим: ";
    cin>>q;

    for (int i=0;i<n;i++)
        for (int j=0;j<m;j++)
    {
       t=matz[i][p];//Запоминаем столбец,который будет заменён
       matz[i][p]=matz[i][q];//Заменяем столбец, который задал пользователь для замены, на столбец, заданный пользователем
       matz[i][q]=t;//В заменённый столбец вставляем значение пользователя
    }

    for (int i=0;i<n;i++)
    {
        for (int j=0;j<n;j++)
            cout<<matz[i][j]<<"\t";
        cout<<endl;
    }




}
