//Мария хочет проверить, если её рост и вес соотвествуют её возрасту.
//Она узнала формулы, по которым можно это вычислить рост и вес ребёнка:
//v - возраст: вес=2*v+8(в кг)
//рост - 5*v+80 (в см).
//Разработайте программу, которая вычислит идеальный рост и вес ребёнка.
//Возраст вводится пользователем.

#include <iostream>

using namespace std;

int main()
{
    cout<<"Vvedite vozrast rebenka: ";
    int v;
    cin>>v;

    cout<<"Idealnii ves: "<<2*v+8<<" kg"<<endl;
    cout<<"Idealnii rost: "<<5*v+80<<" cm";
}
