//Ввол матрицы
//Одномерный массив из максимальных элементов матрицы
//Сумма максимальных элементов матрицы

#include <iostream>

using namespace std;

main()
{
    setlocale (LC_ALL,"Russian");
    cout<<"Введите количество строк: ";
    int n,m,mat[20][20];
    cin>>n;
    cout<<"Введите количество столбцов: ";
    cin>>m;

    for (int i=0; i<n; i++)
    {
        for (int j=0; j<n; j++)
        {
            cout<<"Введите число матрицы для "<<i<<" строчки "<<j<<" столбца: ";
            cin>>mat[i][j];
        }
    }

    int sc=0;
    int x[20];
    for (int i=0; i<n; i++)
    {
        int max=mat[i][0];
        sc++;//Счётчик количества строк
        for (int j=0; j<n; j++)
        {
            if (max<=mat[i][j])//Проверяем на минимальное число в строке матрицы
            {
                max=mat[i][j];//Присваивакм min минимальное значение строки матрицы
                x[i]=mat[i][j];//Вставляем в одномерный массив минимальное значение строки матрицы

            }
        }
    }

    int S=0;
    for (int i=0; i<n; i++)
    {
        S+=x[i];
    }

    cout<<"Сумма максимальныъ элементов для каждой строки матрицы: "<<S;
}
