//Устаревшая денежная система Великобритании состояла из фунтов, шиллингов и пенсов.
//1 фунт был равен 20 шилингам, 1 шилинг - 12 пенсам.
//Например, запись 5.2.8 обозначала 5 фунтов, 2 шиллинга и 8 пенсов(пенс - множественное число от пенни).
//Современная денежная система состоит только из фунтов и пенсов, причём один фунт равен 100 пенсам.
//Такой фунт называют десятичным.
//таким образом 5.2.8 = 5.13(если быть точнее 5.133333).
//7.17.9(по старой системе) = 7.89(по новой)

#include <iostream>

using namespace std;

main()
{
    setlocale(LC_ALL,"Rus");

    int a,b,c;
    float d;
    char l;

    cout<<"Фунтов, шиллингов, пенни (через запятую): ";
    cin>>a>>l>>b>>l>>c;

    d=((a*20.0+b)*12.0+c)/240.0;
    cout<<"Новые деньги: "<<d;
}

