//В одномерном массиве, вводимом с клавиатуры и состоящем из N вещественных элементов вычислить:
//сумму эдементов массива, расположенных после последнего элемента, равного нулю.

#include <iostream>

using namespace std;

main()
{
    setlocale (LC_ALL,"Rus");
    int n,k=0,x[1000];
    cout<<"Введите размер массива: ";
    cin>>n;
    for (int i=0;i<n;i++)
    {
        cout<<"Введите число: ";
        cin>>x[i];
    }

    for (int i=0;i<n;i++)
    {
        if (x[i]==0) k=i;
    }
    int S=0;
    for (;k<n;k++)
        {
            S+=x[k];
        }
    cout<<"Сумма чисел, расположенных после нуля: "<<S;
}
