//В одномерном массиве, вводимом с клавиатуры и состоящем из N вещественных элементов вычислить:
//Количество отрицательных чисел.

#include <iostream>

using namespace std;

main()
{
    setlocale (LC_ALL,"Rus");
    int n,k=0,x[1000];
    cout<<"Введите размер массива: ";
    cin>>n;
    for (int i=0;i<n;i++)
    {
        cout<<"Введите число: ";
        cin>>x[i];
    }
    for (int i=0;i<n;i++)
    {
        if (x[i]>0) k++;
    }
    cout<<endl<<"Количество положительных элементов: "<<k;
}
